IRP/src/InformationRegisters/T9510S_Staffing/T9510S_Staffing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T9510S_Staffing</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>Fired</name>
  <type>
   <types>Boolean</types>
  </type>
 </resources>
 <resources>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <resources>
  <name>Position</name>
  <type>
   <types>CatalogRef.EmployeePositions</types>
  </type>
 </resources>
 <resources>
  <name>EmployeeSchedule</name>
  <type>
   <types>CatalogRef.EmployeeSchedule</types>
  </type>
 </resources>
 <resources>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </resources>
 <dimensions>
  <name>Employee</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/InformationRegisters/T9510S_Staffing/RecordSetModule.bsl
Procedure FillCheckProcessing(Cancel, CheckedAttributes)
	For Each Record In ThisObject Do
		If Record.Fired Then
			CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Company");
			CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Branch");
			CommonFunctionsClientServer.DeleteValueFromArray(CheckedAttributes, "Position");
		Else
			CommonFunctionsClientServer.AddValueToArray(CheckedAttributes, "Company");
			CommonFunctionsClientServer.AddValueToArray(CheckedAttributes, "Branch");
			CommonFunctionsClientServer.AddValueToArray(CheckedAttributes, "Position");
		EndIf;
	EndDo;
EndProcedure
